{"pageProps":{"postData":{"id":"kickflips-and-type-ii-mind","title":"Kickflips and Type II Mind","description":"My investigation into the mind and how we learn vis-a-vis skateboarding","date":"2020-03-27","featured":true,"topics":["Skateboarding","Computational Thinking"],"recommended":"playing-with-a-computational-lens","content":"\n## Skateboarding is all about reps\n\n# Why?\n\nI really should just post some videos to show you visually, but here's how I think about it.\n\n### The answer is complex:\n * You have two parts of your brain involved with motor control (call them Type 1 and Type 2)\n * Type 1 - analytical explicit thought. I tell my arm to go this way and then my leg to go that way\n * Type 2 - execute complex pattern. Do a kickflip\n\nReally there are lots of levels to these things. The Type 1 examples uses Type 2 patterns for lower level “operations”. Type 1 mind says “move arm to the left and then leg to the right”, but each of those instructions are running lower level subroutines in Type 2. One program governs how arms move and the other governs how legs move.\n\nIn order to train the Type 2 brain, you need to give it shit tons of reps. It’s incredibly precise. It can play a symphony perfectly, coordinating exactly which muscles to fire when perfectly every time with sub-millisecond precision. Now, both Types may be active at once. This is typical when you’re first learning a skill. However, Type 2 hangs out in the background at first. Gradually it learns which movements work by paying attention to success signals from the Type 1 “play” and random firing of muscles. Or maybe it just learns movement patterns. I’m not sure how active the feedback mechanism is.\n\nSo the more successful moves/plays you give it, the easier it is to tap into those moves. If you execute 10000 kickfips successfully, Type 2 can easily play one back without thinking about it.\nThe flip side of that is 10000 unsuccessful kick flips also train Type 2. So how do we learn anything?\nWell, there may be an equivalent 10000 different Types of unsuccessful kick flips, and you only executed any one of them a few times. So each one doesn’t get hardcoded as deep as the “correct” ones.\n\n## The key here is you need reps of the correct movement pattern.\n\n### How do you practice that?\n\nWell you have some options. You can do a bunch of random firings trying to get it to work. This doesn’t really use Type 1 at all. If you get enough reps, and enough of those reps are successful it will work. But if you keep executing the same bad movements, then you’ll learn those instead or in addition to the correct ones. That limits your future consistency.\n\nA better strategy is to engage Type 1 and think critically about the movement as you practice. Try different variations out. If some don’t work, don’t keep doing them over and over again. Try leaning this way or that, putting more emphasis on left foot or right foot, experiment with different timings. The problem here is the search space is very complicated, and different individual experiments may not be independent/isolated. If you try to lean one way you may still fail because your kick is the wrong direction, even though it’s the correct way to lean. Knowing the physics of the movement can help here, and as you get more advanced, “simulating” the physics in your mind as a visualization can help you choose which variations to consider. More on that in a future post.\n\n## Another strategy- drills.\n\n### How do drills help?\n\nIf you can simplify the movement down to independent pieces, you can break down the complex process and learn individual parts of the maneuver.\n\nFurthermore, if you can execute certain pieces (or the whole thing) in a “safe” zone, then you don’t have to worry about extraneous factors like getting hurt when you execute it wrong.\n\nFor kickflips, I noticed that much of the time I wasn’t “committing” to the full trick, and so would end up landing with only 1 foot on, or with the board not under my feet. I was scared of landing primo (skateboard term for landing on top of the board on its side, with one set of wheels facing the ground and the other facing the sky), and hurting myself. I was learning suboptimal movement patterns, and not really making much progress. Or at least not making rapid progress.\n\nSo I had an idea- go to a wall with handholds, and practice next to it. That way when I jumped, I could hold on to the wall for support and not worry about falling over if I didn’t land on the board correctly.\n\nIn minutes, I was hitting tons of successful kickflips. Then I started trying not looking down at my feet and just letting Type 2 do its thing internally. Feeling the motion. Surprisingly or not, I was able to land a higher percentage of the kickflips when not looking down. I believe this is because it was easier to keep Type 1 mind out of the way. Gradually, I could then start using the wall less and less. And over time I was hitting a higher percentage of kick flips without much help. At this point, transitioning away from the wall was simpler because I had the kickflips down so well in Type 2 mind. It still took me many many reps away from the wall to really get the movement down, but my progress was soooo much faster after deeply internalizing what the movement is “supposed” to feel like. I’m definitely not a perfect kickflipper now, but at least I can hit some with decent regularity! Next step for this particular trick to gain consistency while moving reasonably fast, and then practice over obstacles.\n\n"},"nextPath":{"id":"playing-with-a-computational-lens","title":"Playing with a Computational Lens","date":"2021-03-29","description":"Overview of what this blog aims to be about.","featured":true,"topics":["Computational Thinking","Writing"],"recommended":"kickflips-and-type-ii-mind","content":null}},"__N_SSG":true}