{"pageProps":{"postData":{"id":"playing-with-a-computational-lens","title":"Playing with a Computational Lens","date":"2021-03-29","description":"Overview of what this blog aims to be about.","featured":true,"topics":["Computational Thinking","Writing"],"recommended":"kickflips-and-type-ii-mind","content":"\nI’ve never kept up a consistent public writing habit, but recently have been convinced to try publishing a weekly blog.\n\nMy blockers previously were four-fold:\n1. I didn’t care enough and had too many other things I was doing to justify it\n1. I didn’t think I was important enough or skilled enough for anyone I cared about to care\n1. I didn’t know what I’d write about\n\nSeveral new developments changed my mind. The first is my budding, yet already deep, relationship with my partner Sam. She started a blog recently. She also led me into the world of social media, and those who make their living off of social media. Through this introduction, I changed my mind about the usefulness & toxicity of social media. Previously I had avoided it like the plague because I was too busy actually “doing things” to bother with “posting things”, and because I didn’t want to get time-sucked in to useless addictive perusal of others’ posts recommended to me by machine learning models written by overpaid, undermoraled engineers. However, I now realize that my mind and discipline are strong enough that I can use social media more along the way its utopian builders envisioned it-- for connection (when posting/uploading) and for inspiration (when browsing/downloading).\n\nFurthermore, stepping deeper into this world showed me how many folks are not experts in the things they post about, even if they literally make their living from it. And yet people follow them. So I started experimenting with posting (metaphorical and literal) snapshots of the types of things I typically do. Low and behold, people seem to enjoy these, and perhaps some people even live vicariously through me a bit. I do a lot of weird things at once.\n\nBlocker 2 is thus crossed off. I gained a bit of confidence and clarity in the relevance of what I do on a daily or weekly basis, and the way I interact with the world.\n\nErasing blocker 1 was a secondary consequence of this as well. As I realized that people may actually be interested in what I do or have to say, I began to spend more time thinking about how I can live more publicly, and also how that could benefit both my career (via reputation/credibility) and the lives of others (e.g. inspiring them to do more). Blogs are a bit different than posting on Instagram, so the step from posting random pictures or videos to writing well-formatted thought pieces took a bit of time. I wanted to write technically, because it’s fun for me and seems important to my career, but I also didn’t want to spend a ton of my precious free time working on software-related side projects.\n\nThen I looked at a few of the random notes that I jotted down over the last few months, and a pattern emerged. While most of my time outside of my full-time job is spend on non-software, the way I approach, describe, and think about all my activities is incredibly similar to the way I do so for technical software projects. My systems-oriented, computational, abstraction-building mind finds targets in pursuits as far ranging as fermentation and other cooking, skateboarding, human mobility, health, spirituality, habit-formation, cryptocurrency, and outdoor sports.\n\nBlocker 3 erased- I’ll try just writing about the things that I do, mostly outside of “work” itself, but with the added flare that comes from a deep technical background.\n\nMy goal is that folks coming from the worlds of each of these non-technical hobbies will learn a bit of a new perspective on their craft, and that folks coming from the world of technical software or other engineering will gain a deeper understanding of the way their own minds work by seeing familiar techniques applied to unfamiliar scenarios.\n\n\nI hope you enjoy it!\n"},"nextPath":{"id":"kickflips-and-type-ii-mind","title":"Kickflips and Type II Mind","description":"My investigation into the mind and how we learn vis-a-vis skateboarding","date":"2020-03-27","featured":true,"topics":["Skateboarding","Computational Thinking"],"recommended":"playing-with-a-computational-lens","content":null}},"__N_SSG":true}